In [2]:
#Terlebih dahulu mengimport modules

import pandas as pd

print(pd.__version__)

1.2.4

In [3]:
#Mempersiapkan Data Frame

data = {'Nama': ['Thomas', 'Lewi', 'Dina', 'Grace'],
        'Jenis_Kelamin':['L', 'L', 'P', 'P'],
        'Usia':[20, 22, 24, 21]}

df = pd.DataFrame(data)
df

     Nama Jenis_Kelamin  Usia
0  Thomas             L    20
1    Lewi             L    22
2    Dina             P    24
3   Grace             P    21

In [4]:
#Menyatukan kolom dengan str.cat()

df['Nama'].str.cat(df['Jenis_Kelamin'], sep=', ').to_frame()

        Nama
0  Thomas, L
1    Lewi, L
2    Dina, P
3   Grace, P

In [5]:
df['Nama_JK'] = df['Nama'].str.cat(df['Jenis_Kelamin'], sep=', ')
df

     Nama Jenis_Kelamin  Usia    Nama_JK
0  Thomas             L    20  Thomas, L
1    Lewi             L    22    Lewi, L
2    Dina             P    24    Dina, P
3   Grace             P    21   Grace, P

In [6]:
df['Nama'].str.cat(df['Usia'].astype('str'), sep=' - ').to_frame()

          Nama
0  Thomas - 20
1    Lewi - 22
2    Dina - 24
3   Grace - 21

In [9]:
df['Nama_Usia'] = df['Nama'].str.cat(df['Usia'].astype('str'), sep=' - ')
df

     Nama Jenis_Kelamin  Usia    Nama_JK    Nama_Usia
0  Thomas             L    20  Thomas, L  Thomas - 20
1    Lewi             L    22    Lewi, L    Lewi - 22
2    Dina             P    24    Dina, P    Dina - 24
3   Grace             P    21   Grace, P   Grace - 21